Revit 2026 API

# PathOfTravelCreateMapped(View, IListXYZ, IListXYZ, IListPathOfTravelCalculationStatus) Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<PathOfTravel> CreateMapped(
	View DBView,
	IList<XYZ> pathStarts,
	IList<XYZ> pathEnds,
	out IList<PathOfTravelCalculationStatus> resultStatus
)
```
```vb
Public Shared Function CreateMapped (
	DBView As View,
	pathStarts As IList(Of XYZ),
	pathEnds As IList(Of XYZ),
	<OutAttribute> ByRef resultStatus As IList(Of PathOfTravelCalculationStatus)
) As IList(Of PathOfTravel)
```
```cpp
public:
static IList<PathOfTravel^>^ CreateMapped(
	View^ DBView,
	IList<XYZ^>^ pathStarts,
	IList<XYZ^>^ pathEnds,
	[OutAttribute] IList<PathOfTravelCalculationStatus>^% resultStatus
)
```
```fsharp
static member CreateMapped :
        DBView : View *
        pathStarts : IList<XYZ> *
        pathEnds : IList<XYZ> *
        resultStatus : IList<PathOfTravelCalculationStatus> byref -> IList<PathOfTravel>
```

#### Parameters

DBView View

pathStarts IListXYZ

pathEnds IListXYZ

resultStatus IListPathOfTravelCalculationStatus

#### Return Value

IListPathOfTravel

#### Reference

PathOfTravel Class

CreateMapped Overload

Autodesk.Revit.DB.Analysis Namespace